Tekla Open API Reference for Tekla Structures 2025
GridPlane.Color Property
Note: This API is now obsolete.
 The color of the grid plane. This works only in wireframe views. The color of grid planes in rendered views can be changed using the advanced option XS_GRID_COLOR.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Property not supported anymore.")]
public int Color { get; set; }
<ObsoleteAttribute("Property not supported anymore.")>
Public Property Color As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace